#pragma once

// Алгоритмы на графах
namespace nsAlgorithmsOnGraphs
{
	void main();

	// перечень всех функций на векторах STL, которые были задействованы в наших программах:
	// - Конструктор по умолчанию создает пустой вектор. 
	// - Конструктор vec(n) строит вектор из п элементов.
	// - Конструктор vec(n, x) строит вектор из n элементов, каждый из которых инициализируется значением х.
	// - Функция-элемент vec.assign(n, x) преобразует vec в вектор из n элементов, каждый из которых инициализируется значением х.
	// - Функция-элемент vec.resize(n) возрастает или убывает, получая пропускную способность n.
	// - Функция-элемент vec.resize(n, x) увеличивает или уменьшает vec, получающий пропускную способность n, и инициализирует любые новые элементы значением х.
}
