#pragma once

namespace nsDataStructures
{
	// Рекурсия и деревья
	namespace nsRecursionAndTrees
	{
		void main();

		// В языках программирования рекурсивной программой называют программу, которая обращается к самой себе(подобно тому, как в математике рекурсивной функцией называют функцию, которая определена через понятия самой этой функции).
		// Следовательно, вторая важная особенность рекурсивной программы — наличие условия завершения, позволяющего программе прекратить вызывать себя.
		
		// 5.1 Рекурсивные алгоритмы
		// 190...
	}
}
